"""
რა არის ეჯაილი და ბექლოგი? 

ეჯაილი არის პროექტების მართვის მეთოდოლოგია, რომელიც
გულისხმობს რომ პროექტი იყოფა ნაწილებად, სპრინტებად და ყოველი
სპრიტის შემდეგ მიიღება მუშა პროდუქტი. ბექლოგი არის იმ აითემების, 
თასქების სია, რომლებიც უნდა შესრულდეს მთლიანი პროცესის
განმავლობაში. ხოლო რომელ სპრინტში რომელი თასქი გადავიდეს
წყვეტს დეველოპერების გუნდი.



რა არის ვაიფრეიმი ?

ვაიფრეიმი არის ვიზუალური მარტივი მონახაზი, ჩანახატი ვებ-გვერდის, 
აპლიკაციის ან სხვა ინტერფესის, რომელსაც ხატავენ როგორც ხელით, 
ასევე ციფრულ პლატფორმებზე. ვაიერფრეიმი გვაჩვენებს ფუნქციონალს,
ელემენტებს და user flow-ს. ვიზუალიზაციის სამი ხარსხი აქვს, მესამეა
როდესაც ყველაზე მეტად არის მიახლოვებული საბოლოო პროდუქტთან, 
შეიცავს სურათებს, ტექსტს, აიქონებს და ა.შ



რა არის ევრისტიკა და რამდენი სახის არსებობს?

ევრისტიკა არის ჯეიკობ ნილსენის მიერ ჩამოყალიბებული 10 პრინციპი
თუ როგორ შეიძლება ისე გავაკეთოთ დიზიანი, რომ იყოს
მომხმარებელზე მორგებული. 
#1: Visibility of system status
The design should always keep users informed about what is going on, through 
appropriate feedback within a reasonable amount of time.
#2: Match between system and the real world
The design should speak the users' language.
#3: User control and freedom
#4: Consistency and standards
Users should not have to wonder whether different words, situations, or actions 
mean the same thing. Follow platform and industry conventions
#5: Error prevention
Good error messages are important, but the best designs carefully prevent 
problems from occurring in the first place. Either eliminate error-prone 
conditions, or check for them and present users with a confirmation option 
before they commit to the action.
#6: Recognition rather than recall
Minimize the user's memory load by making elements, actions, and options 
visible. The user should not have to remember information from one part of the 
interface to another.
#7: Flexibility and efficiency of use
Shortcuts — hidden from novice users — may speed up the interaction for the 
expert user so that the design can cater to both inexperienced and experienced 
users. Allow users to tailor frequent actions.
#8: Aesthetic and minimalist design
#9: Help users recognize, diagnose, and recover from errors
Error messages should be expressed in plain language (no error codes), 
precisely indicate the problem, and constructively suggest a solution.
#10: Help and documentation
It’s best if the system doesn’t need any additional explanation. However, it may 
be necessary to provide documentation to help users understand how to 
complete their tasks.
ვექტორში გვაქვს მათემატიკა
რასტრში პიქსელები
3D გრაფიკაში პოლიგონები (სამკუთხედები, რომელთა შეერთებით შეგვიძლია სასურველი 
ფორმის მიღება და რაც უფრო მეტია ვიღებთ უფრო გლუვი გამოდის ფორმა 
BOUNCE RATE- როდესაც იუზერი ერთ ფეიჯზე რჩება მარტო და არ გადადის 20%-მდე მისაღებია.



სად გამოიყენება სამომხმარებლო ინტერფეისი? 

ყველგან სადაც ეკრანია და მისი მიზანია მომხმარებლის გამოცდილება
გაამარტივოს იქნება ეს კომპიუტერთან, მობილურთან, აპლიკაციასთან
თუ არატრადიციულ ინტერფეისთან ინტერაქციისას.
შეიძლება იყოს ფიზიკური მოწყობილობით და ეკრანით ან მხოლოდ
ეკრანით. თუ ეკრანი არაა მაშინ არის UI მობილური, ლეპტოპი,
ინტერფეისის სტატუსი 
ვიზუალურად გვაძლევს სიგნალს სად ვართ და რას ვაკეთებთ. რაღაც
მდგომარეობაში დიზაინი იცვლის იერსახეს, ეს შეიძლება იყოს როდესაც
მაგალითად ვიზუალურად შეგიძლია დაინახო რომ ახლა ხარ მთავარ
გვერდზე საიტზე, რადგან ღილაკის ადგილი მუქდება როდესაც
გადადიხარ. გამოჩნდეს წრეების ტრიალი როდესაც რაიმე იტვირთება, 
დაეხატოს წითელი წერტილი შეტყობინებების აიქონს, როდესაც ახალი
წერილი მოვა და ა.შ.





რა უპირატესობა აქვს ინტერფეისში ვექტორული ელემენტების გამოყენებას? 

ამსუბუქებს
 



 
რა არის ექსესებილითი?

რამდენად ხელმისწავდომია ყველასთვის და განსაკუთრებით
ფოკუსირებულია შეზღუდული შესაძლებლობების ადამიანებისთვის
ხელმისაწვდომობაზე. არსებობს გაიდლაინები Wsag და შესაძლებელია
დონის დადგენა A, AA, AAA
Section 50
Screen reader- ბრაუზერი უსინათლოებისთვის
 



Usability

რამდენად მარტივია ინტერფეისი გამოსაყენბლად და რამდენად შეესაბამება მისი
მახასიათებლები მომხმარებელთა საჭიროებებსა და კონტექსტებს. ეფექტური უნდა 
იყოს, ზუსტად შეეძლოს მომხმარებელს, სწწრაფი, სასიამოვნო.
• Learnability: How easy is it for users to accomplish basic tasks the first 
time they encounter the design?
• Efficiency: Once users have learned the design, how quickly can they 
perform tasks?
• Memorability: When users return to the design after a period of not 
using it, how easily can they reestablish proficiency?
• Errors: How many errors do users make, how severe are these errors, 
and how easily can they recover from the errors?
• Satisfaction: How pleasant is it to use the design?
utility, which refers to the design's functionality: Does it do what users need?
 



როგორ ყალიბდება დიზაინის ბრიფი 

დოკუმენტი რომელსაც წერს დამკვეთი დიზაინერისთვის, პროექტის აღწერა, 
რა არის გასაკეთებელი, რას მოელის და ყველა საჭირო ინფორმაცია ისე, 
რომ სასურველია კითხვები არ დარჩეს დიზაინერს. კომპანიის აღწერა, რას
აკეთებს, პერსონა/ები, ფუნქციონალი, ბიუჯეტი, ვადები.
 
 
 

atomic design 

ისეთი კომპონენტების სისტემა ან ბიბლიოთეკა რომლებიც მიღებულია
როგორც სტანდარტი და შაბლონად შეიძლება იყოს გამოყენებული
დიზაინში, ვაირფრეიმში თუ ა.შ. და არ გაკეთდეს ახალი. მაგალითად, 
ღილაკები.
 




რა არის გრაფიკული დიზაინი 

კრეატიული პროცესის შედეგად ინფორმაციის ორგანიზება(ტექსტი
აუდიო, ფოტო, ცხრილი, ა.შ) და პრეზენტაცია (ვისთვის ვაკეთებთ, 
რამდენად გაიგებს ის) კონკრეტული დანიშნულებისთვის.
ელემენტები: ხაზი, ფორმა, space (დაშორება ობექთივიდან
ობჯეთივამდე), ტექსტურა (noise), ტიპოგრაფია, ფორმა, ფერი, ფოტო, 
ვიდეო
პრინციპები: კონტრასტი, იერარქია, განლაგება, ბალანსი
 



რა განსხვავებაა UI და UX შორის 

UX-ის მიმართულებაა მომხმარებლის გამოცდილების შესწავლა, 
დაკვირვებაა, ტესტირება, რაზე დაყრდნობიტაც განსაზღვრავს ვებ-გვერდსა 
თუ აპლიკაციაში სად, რა, რამდენი იქნება, რომ საბოლოო ჯამში
ფუნქციურად პროდუქტი იყოს მაქსიმალურად მორგებული მის
აუდიტორიაზე. სამომხმარებლო ინტერფეისი კი ვიზუალურ
ელემენტების მაგალითად ფორმაზე, ფერზე, ზომაზე, ფონტზე, 
სურათებზე ზრუნავს, რომ მიიღოს მარტივი მაგრამ ესთეტიკური
დიზაინი.




რა არის KPI 

წარმატების საზომი მეტრიკები, იმის გასაზომად თუ რამდენად ახლოსაა
გუნდი მიზანთან. მასზე დაკვირვივებით მიღებული ინსაითები
გვეხმარება უფრო ეფექტური გადაწყვეტილებების მიღებაში.
 




რამდენად მნიშნელოვანია ფურცელზე ვაიფრეიმი 

ყველა პროფესიონალი მხატვარი სანამ ტილოზე ზეთით ხატვაზე გადავა, 
ფანქრით აკეთებს ჩანახატს, რადგან იდეის პირდაპირ სამუშაო ადგილზე
გადატანას ბევრი ჩასწორება მოყვება, რაც შეიძლება ვეღარც
გამოსწორდეს. ასეა ვაიფრეიმის შემთხვევაში, მოგივა იდეა, აოღებ
ფურცელს დახატავ, არ მოგეწონება გადააგდებ, დახატავ, ახალი იდეა
მოგივა ზედ გადაახატავ და ასე წარმოსახვის განვიათარებით ჩონჩხივით
ჩამოაყალიბებ რა ჯობია, რომელსაც შემდეგ დეტალურად გადაიტან
რომელიმე პლატფორმაში, რაც უკვე იმის საშუალებას იძლევა რასაც
ფურცელზე ვერ გააკეთებ.





დიზაინერული აზროვნება 

“Design Thinking “, იგივე დიზაინერული აზროვნება, ან აზროვნების
დიზაინი, არის მომხმარებელზე დაფუძნებული მეთოდოლოგია, რომელიც
გულისმხობს კრეატიული, სპონტანური და ინოვაციური პრობლემის
გადაჭრის გზების აღმოჩენას. UX/UI დიზაინერები და ტესტერები
ეფექტურად იეყენებნ სამუშაო პროცესში, რომ დააკვირდნენ მომხმარებელს
პროცესში რა უჭირს, რა პრობლემებს აწყდებიან, დააგენერირონ იდეები და
გაირონ 6 ეტაპი აზროვნების.





ბრენდბუქი 

შაბლონი ბრენდის გაიდლაინებისა იმის შესახებ თუ რა არის მისი მისია, 
ღირებულებები, რა სტილს იყენებს, რა ფერები, რა ფონტი, როგორი სტილის
სურათები და პოსტეერბი, tone of voice
 




Insight 

ვფლობ ინფორმაციას რომელიც მარტივად ხელმისაწვდომი არ არის, 
ფაქტები, დატა, მაგალითად ჩვენი მომხმარებლების შესახებ, რომელიც
კონკრეტული საგნის კარგად გააზრების საშუალებას გვაძლევს.
User-კომპიუტერი 
Direct- browerში წერს 
Referral-რეკომენდაცია 
სესია- ერთჯერადი ინტერაქცია 



 
A/B- ორი ვარიანტი გაქვს პროდუქტის აჩვენებ ორივეს მომხმარებელს, 
აკვირდები და რომელსაც უკეთესი შედეგი ექნება ტოვებ
Remote testing- დისტრანციურად ტესტავ მომხმარებელს, წინასწარ წერ
სცენარს რაც უნდა გააკეთოს და შენ კონტაქტი არ გაქვს
"""